app/controllers/categories_controller.rb

    def show
        @category = Category.find(params[:id])
        @notes =Note.where(category_id: params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."category_id" = ?  [["category_id", 2]]