app/controllers/memos_controller.rb

INSERT INTO "notes" ("title", "body", "created_at", "updated_at", "category_id", "image") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ああああ"], ["body", "ああああ"], ["created_at", "2020-07-03 09:52:25.164939"], ["updated_at", "2020-07-03 09:52:25.164939"], ["category_id", 4], ["image", nil]]
---
    def create
        Note.create(title:params["memos"]["title"],body:params["memos"]["body"],category_id:params["memos"]["category_id"],image:params["memos"]["image"])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
       @note=Note.find(params["id"])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "body" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["body", "sadfsdvafbfwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww"], ["updated_at", "2020-07-02 12:31:57.501438"], ["id", 6]]
---
    def update
        note = Note.find(params["id"])
        note.title = params["memos"]["title"]
        note.body = params["memos"]["body"]
        note.category_id =params["memos"]["category_id"]
        note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]
---
    def destroy
        note = Note.find(params["id"])
        note.destroy

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def details
        @note=Note.find(params["id"])